TOKEN = '7941160169:AAGoyLOO7oA6GzH6q45dqJJWShg02oigGsc'

test = [
    {
        'question': '1/10: Как вы обычно проводите время в свободные дни?',
        'answer': {
            'Читаю книги и слушаю музыку': 1,
            'Занимаюсь спортом и путешествую': 3,
            'Работаю над целями и учусь новому': 2,
            'Встречаюсь с друзьями и семьей': 4,
        }
    },
    {
        'question': '2/10: Как вы справляетесь со стрессом?',
        'answer': {
            'Медитирую и занимаюсь йогой': 1,
            'Занимаюсь активным отдыхом': 3,
            'Реализую свои планы': 2,
            'Обсуждаю с друзьями и семьей': 4
        }
    },
    {
        'question': '3/10: Как вы обычно решаете проблемы?',
        'answer': {
            'Выбираю оптимальный вариант': 1,
            'Действую интуитивно и быстро': 3,
            'Разрабатываю стратегию': 2,
            'Советуюсь с друзьями и семьей': 4
        }
    },
    {
        'question': '4/10: Как вы относитесь к новым знакомствам?',
        'answer': {
            'Осторожно, но открыт к знакомству': 1,
            'С энтузиазмом и открытостью': 3,
            'Осторожно, но готов сотрудничать': 2,
            'С теплотой и радостью': 4
        }
    },
    {
        'question': '5/10: Как вы обычно ведете себя в компании?',
        'answer': {
            'Слушаю и наблюдаю': 1,
            'Активно участвую и веду за собой': 3,
            'Анализируете и оцениваете': 2,
            'Общаетесь и развлекаетесь': 4
        }
    },
    {
        'question': '6/10: Как вы относитесь к изменениям в жизни?',
        'answer': {
            'Настороженно, но адаптируюсь': 1,
            'С энтузиазмом и любопытством': 3,
            'Анализирую и строю планы': 2,
            'С теплотой и поддержкой': 4
        }
    },
    {
        'question': '7/10: Как вы обычно решаете конфликты?',
        'answer': {
            'Постепенно и осторожно': 1,
            'Прямо и открыто': 3,
            'Стратегически и логически': 2,
            'С теплотой и эмпатией': 4
        }
    },
    {
        'question': '8/10: Как вы обычно проводите время на работе?',
        'answer': {
            'Самостоятельно и внимательно': 1,
            'Активно сотрудничаю с коллегами': 3,
            'Придумываю решения и веду проекты': 2,
            'Общаюсь и укрепляю командный дух': 4
        }
    },
    {
        'question': '9/10: Как вы относитесь к своим целям?',
        'answer': {
            'Постепенно и последовательно': 1,
            'Амбициозно и решительно': 3,
            'Стратегически и планируя': 2,
            'С теплотой и поддержкой': 4
        }
    },
    {
        'question': '10/10: Как вы обычно справляетесь с неудачами?',
        'answer': {
            'Анализирую причины и ищу уроки': 1,
            'Принимаю вызов и действую': 3,
            'Планирую и исправляю ошибки': 2,
            'Ищу поддержку у друзей и семьи': 4
        }
    },
]

descriptions = [
    'Вы предпочитаете уединение, спокойствие и комфорт. Вы аналитичны и осторожны в своих действиях.',
    'Вы умны, изобретательны и любите исследовать новые возможности. Вы готовы к изменениям и адаптации.',
    'Вы амбициозны, решительны и готовы к действиям. Вы предпочитаете работать в команде и достигать общих целей.',
    'Вы теплы, дружелюбны и заботливы. Вы предпочитаете общение и сотрудничество с другими.'
]

counting = {}

results = {}
